title: Replace String Test
id: 92345678-1234-1234-1234-123456789012
status: test
description: Test rule for replace string transformation
author: Test Author
date: 2025-01-01
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image: 'C:\Windows\System32\cmd.exe'
        ParentImage: '*\powershell.exe'
        TargetFileName: 'C:\explorer.exe'
    condition: selection
falsepositives:
    - Administrative activity
level: medium
