title: Convert Type Test
id: 13345678-2345-1234-1234-123456789012
status: test
description: Test rule for convert type transformation
author: Test Author
date: 2025-01-01
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: '1'                 # String value that will be converted to number
        ProcessId: 1234              # Number that will be converted to string
    condition: selection
falsepositives:
    - None
level: low
